Tekla Open API Reference for Tekla Structures 2025
AnalysisNodeLink Properties
The AnalysisNodeLink type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
CoordinateSystem
 The coordinate system of the analysis node link.
Disabled
 Indicates whether the analysis node link is disabled.
EndConnectivity
 The end connectivity of the analysis node link.
EndNode
 The end node.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
IsUserConnectivity
 Indicates whether the analysis node has a user defined connectivity.
IsUserNodeLink
 Indicates whether the analysis node is a user node link.
OwnerPartIDs
 The list of the identifiers of the owner parts.
StartConnectivity
 The start connectivity of the analysis node link.
StartNode
 The start node.
Top
See Also
Reference
AnalysisNodeLink Class
Tekla.Structures.Analysis Namespace